## 필요라이브러리
- 기술통계분석에 필요한 외부패키지들
- Pandas, 파이썬 기반의 외부 패키지

In [22]:
import numpy as np
import pandas as pd # 데이터 프레임 기능 있음
import matplotlib.pyplot as plt

## Pandas 자료구조
- Series, Index,Data Frame 
### series

In [2]:
# 시리즈(series) : Numpy의 1차원 배열과 유사하다., 클래스
## 시리즈 = 인덱스 + 값(value)
obj = pd.Series([1,2,3,4,5])
x = np.array([1,2,3,4,5])

In [3]:
x

array([1, 2, 3, 4, 5])

In [4]:
obj # 앞에 인덱스 값이 같이 출력됨.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# 시리즈 생성
s = pd.Series([9904312,3448737,2890451,2466052],
             index = ['서울','대전','대구','부산'])
s

서울    9904312
대전    3448737
대구    2890451
부산    2466052
dtype: int64

In [7]:
s.index

Index(['서울', '대전', '대구', '부산'], dtype='object')

In [8]:
s.values # 1차원 배열과 유사

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [9]:
s.name = '인구'
s.index.name = 'city'
s

city
서울    9904312
대전    3448737
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [10]:
s / 1000000

city
서울    9.904312
대전    3.448737
대구    2.890451
부산    2.466052
Name: 인구, dtype: float64

In [11]:
s[1]

3448737

In [12]:
s['대전']

3448737

In [13]:
s[[0,3,1]] # 하나 이상일때 []로 묶어서

city
서울    9904312
부산    2466052
대전    3448737
Name: 인구, dtype: int64

In [14]:
s[['부산','서울','대전']]

city
부산    2466052
서울    9904312
대전    3448737
Name: 인구, dtype: int64

In [15]:
s

city
서울    9904312
대전    3448737
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [17]:
# 인구가 250만 초과 500만 미만
s[(s > 2500000) & (s < 5000000)]  #### 얘는 왜 소괄호야?

city
대전    3448737
대구    2890451
Name: 인구, dtype: int64

In [18]:
s[1:3] # 1번째, 2번쨰

city
대전    3448737
대구    2890451
Name: 인구, dtype: int64

In [19]:
s

city
서울    9904312
대전    3448737
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [20]:
s['대구':'부산'] # 숫자 인덱스와 달리 마지막 범위로 적은 값까지 출력됨.

city
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [23]:
s0 = pd.Series(range(3), index = ['a','b','c'])
s0

a    0
b    1
c    2
dtype: int64

In [28]:
# index a위치 값 불러오기
s0.a  # 다이렉트 연산자로 바로 접근 가능
s0[0] # 인덱스로
s0['a'] # 라벨로

0

In [29]:
'서울' in s

True

In [30]:
'인천' in s

False

In [ ]:
# 사전.keys()
# 사전.values()
# 사전.items()

In [31]:
for k, v in s.items():
    print("%s = %d" % (k,v))

서울 = 9904312
대전 = 3448737
대구 = 2890451
부산 = 2466052

In [32]:
s2 = pd.Series({'Seoul':9632482, 'Busan':3393292,
                'Incheon': 2632035, 'Daeseon': 1490158}) # 순서가 없음 / 파이썬 3.7부터는 순서해줌
s2

Seoul      9632482
Busan      3393292
Incheon    2632035
Daeseon    1490158
dtype: int64

In [33]:
# 순서를 주고 싶다면 인덱스 추가
s2 = pd.Series({'Seoul':9632482, 'Busan':3393292,
                'Incheon': 2632035, 'Daeseon': 1490158},
              index = ['Busan','Daeseon','Incheon','Seoul']) # 순서 변경시
s2

Busan      3393292
Daeseon    1490158
Incheon    2632035
Seoul      9632482
dtype: int64

In [34]:
# 파이썬의 dict
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)
## 사전의 키값은 시리즈의 인덱스가 된다.
obj3
### 위에서 정수값으로 담았으니깐 int형이 되는것이고

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [35]:
# 파이썬의 List
states = ['California','Ohio','Oregon','Texas'] # index로 쓸겨
obj4 = pd.Series(sdata, index = states) 
## sdata의 인덱스와 동일한 인덱스는 sdata의 value를 불러오지만 해당하는 게 없다면 not a number(NaN)
obj4

### 얘는 불러온거지 직접 값을 부여한게 아니기 때문에 기본형이 실수형이되는 거

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [37]:
# isnull(), notnull(), 
pd.isnull(obj4), pd.notnull(obj4)

(California     True
 Ohio          False
 Oregon        False
 Texas         False
 dtype: bool,
 California    False
 Ohio           True
 Oregon         True
 Texas          True
 dtype: bool)

#### series의 연산

In [38]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [39]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
# 연산 시 기본적으로 색인을 기준으로 묶인다.
## 대응되는 인덱스가 없는경우 NA와 연산되는데 NA는 연산이 불가해서 결국 NA값이 나온다.
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

### Data Frame(데이터 프레임)
- 표형태로 구현된 자료구조
- 2차원 행렬 + 인덱스(row index, column index)

In [41]:
# 만드는 예시
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ['지역', '2015','2010','2005','2000','2010-2015 증가율']
index = ['서울','부산','인천','대구']

df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [42]:
# head 기본은 5개 출력 // R은 6개지만,
df.head(3)

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

In [44]:
df.info()  # R의 str과 유사

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 대구
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지역             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2000           4 non-null      int64
 5   2010-2015 증가율  4 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 224.0+ bytes

In [45]:
df.describe() # R의 summary와 유사

               2015          2010          2005          2000  2010-2015 증가율
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00       4.000000
mean   4.677388e+06  4.522120e+06  4.562197e+06  4.612434e+06       0.039225
std    3.507776e+06  3.431328e+06  3.500545e+06  3.538749e+06       0.039809
min    2.466052e+06  2.431774e+06  2.456016e+06  2.466338e+06       0.014100
25%    2.784351e+06  2.581970e+06  2.502264e+06  2.472077e+06       0.015750
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.064714e+06       0.022300
75%    5.062631e+06  4.952764e+06  5.075047e+06  5.205071e+06       0.045775
max    9.904312e+06  9.631482e+06  9.762546e+06  9.853972e+06       0.098200

In [46]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [47]:
df.columns  # 열인덱스
# object는 문자타입을 의미함.

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [48]:
df.index # 행인덱스

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [49]:
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [50]:
df.columns.name = '특성'
df.index.name = '도시'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [51]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [53]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

#### 삭제

In [56]:
# 삭제시키기
## 여러 개를 삭제 시 리스트로 묵어서
## 기본이 행우선이여서 옵션으로 axis = 1
df = df.drop('2010-2015 증가율', axis = 1)

In [57]:
df

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

In [65]:
# 열을 삭제하는 함수
del df['2005-2010 증가율'] 
## 얘는 변수에 다시 담지않아도 원본값도 변경됨
df

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

#### 변수 생성

In [66]:
# 2005-2010 증가율을 나타내는 변수 생성
## 소수점 이하 둘째 자릿수까지

# 열추가
df['2005-2010 증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [67]:
df['지역'] # 하나로 가져올 땐 시리즈로 가져옴

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [68]:
df[['2010','2015']] # 하나이상은 데이터프레임(표)

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [70]:
## 하나의 값인데 데이터프레임으로 가져오고 싶을때
df[['지역']] # 리스트로 한번 더 묶어서

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [71]:
# 자료형 확인 type
type(df[['지역']])

pandas.core.frame.DataFrame

#### loc와 iloc를 이용한 인덱스와 슬라이싱

In [72]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [73]:
frame = pd.DataFrame(data)
frame
# index를 따로 설정안했으니 자동으로 설정해줌

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [75]:
# 열 인덱스, 행 인덱스
frame.columns, frame.index

(Index(['state', 'year', 'pop'], dtype='object'),
 RangeIndex(start=0, stop=6, step=1))

In [77]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                      index = ['one', 'two', 'three', 'four', 'five', 'six']) # 라벨링
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [79]:
# 열은 다이렉트 연산자 가능
frame2['year'], frame2.year

(one      2000
 two      2001
 three    2002
 four     2001
 five     2002
 six      2003
 Name: year, dtype: int64,
 one      2000
 two      2001
 three    2002
 four     2001
 five     2002
 six      2003
 Name: year, dtype: int64)

In [84]:
# 행은?? frame.loc['행인덱스']
## 행 일때는 규칙을 줘서 열을 불러오는거와 구별될 수 있게 함.
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [86]:
## 행의 숫자 인덱스인 경우는?? frame.iloc[숫자인덱스]
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [87]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [88]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [89]:
# 데이터 프레임에 값을 담을 때는 반드시 크기가 같아야함. 그렇지 않으면 NaN(missing value결측값)이 발생.
val = pd.Series([-1.2,-1.5,-1.7],
               index = ['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [90]:
# df는 여러개의 시리즈 객체가 결합된 형태임.
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [91]:
# 파생변수: 기존 값을 활용하여 새로운 컬럼을 추가
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [92]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [94]:
# 중첩된 값은 로우의 인덱스가 된다. 즉, 사전 안의 사전의 키값이 행의 인덱스
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [96]:
pd.DataFrame(pop, index = [2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [97]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [100]:
# 행 추가 
frame2.loc['seven'] = [2004,'Nevada',3.0, -1.2, False]
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False
seven  2004  Nevada  3.0  -1.2    False